In [1]:
import pandas as pd

In [6]:
data = {
    "name" : ['kamal', 'Tarshit', 'Mukesh', "Siva"], 
    'Age' : [12, 23, 33, 12],
    'Grade' : ['A+', 'O', 'A', 'A']
}
data

{'Age': [12, 23, 33, 12],
 'Grade': ['A+', 'O', 'A', 'A'],
 'name': ['kamal', 'Tarshit', 'Mukesh', 'Siva']}

In [49]:
df = pd.DataFrame(data)
df

      name  Age Grade
0    kamal   12    A+
1  Tarshit   23     O
2   Mukesh   33     A
3     Siva   12     A

In [8]:
df.head(2)

      name  Age Grade
0    kamal   12    A+
1  Tarshit   23     O

In [9]:
df.tail(1)

   name  Age Grade
3  Siva   12     A

In [12]:
df.sample(1)

   name  Age Grade
3  Siva   12     A

In [13]:
df.columns

Index(['name', 'Age', 'Grade'], dtype='object')

In [14]:
df.dtypes

name     object
Age       int64
Grade    object
dtype: object

In [17]:
df['Age'].dtypes

dtype('int64')

In [27]:
df.set_index('name', inplace = True)
df

        Grade
name
kamal      A+
Tarshit     O
Mukesh      A
Siva        A

In [31]:
df['name']

0      kamal
1    Tarshit
2     Mukesh
3       Siva
Name: name, dtype: object

In [32]:
df.name

0      kamal
1    Tarshit
2     Mukesh
3       Siva
Name: name, dtype: object

In [35]:
df[['name', 'Age']]

      name  Age
0    kamal   12
1  Tarshit   23
2   Mukesh   33
3     Siva   12

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   Age     4 non-null      int64
 2   Grade   4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [39]:
df.describe()

             Age
count   4.000000
mean   20.000000
std    10.099505
min    12.000000
25%    12.000000
50%    17.500000
75%    25.500000
max    33.000000

In [42]:
dg = df['Age'].value_counts()
dg

12    2
23    1
33    1
Name: Age, dtype: int64

In [65]:
df = pd.DataFrame(data)
dg = df.drop(2,axis=0, inplace=False)
#df
dg

      name  Age Grade
0    kamal   12    A+
1  Tarshit   23     O
3     Siva   12     A